src/InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_МП_ВнешниеОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_МП_ВнешниеОстатки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_МП_ВнешниеИсточникиОстатков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/РаспределениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РаспределениеЗапасов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Свободно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РаспределениеЗапасовСостояния</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_MP_ОграничениеОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_MP_ОграничениеОстатков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Али_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ВБ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КарточкаМП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_РазмерыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_АЛИ_Вариации</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_MP_РучныеОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_MP_РучныеОстатки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Али_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ВБ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Склады</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КарточкаМП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_РазмерыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_АЛИ_Вариации</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_MP_ПоследниеВыгруженныеОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_MP_ПоследниеВыгруженныеОстатки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Али_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ВБ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КарточкаМП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_РазмерыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_АЛИ_Вариации</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/РаспределениеЗапасовСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РаспределениеЗапасовСостояния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОстатокНаСкладе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ИС_МП_ВнешниеИсточникиОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_МП_ВнешниеИсточникиОстатков</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СопоставлятьПо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеСопоставления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеОстатка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеЦены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставЗагружаемыхДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяСтрока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяКолонка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследняяСтрока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследняяКолонка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ИС_МП_УправлениеОстатками/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Ивонин К.А. 14.03.24 УА #71892
Функция ПолучитьТекстЗапросаОстатков(Маркетплейс) Экспорт
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		Возврат ИС_Ozon_Сервер.ПолучитьТекстЗапросаОстатков();
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		Возврат ИС_ЯМ_Сервер.ПолучитьТекстЗапросаОстатков();
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		Возврат ИС_Сбер_Сервер.ПолучитьТекстЗапросаОстатков();
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		Возврат ИС_АЛИ_Сервер.ПолучитьТекстЗапросаОстатков();
	КонецЕсли;
	
	ОбщийМодуль = ИС_МП_Сервер.ОбщийМодульМаркетплейса(Маркетплейс);
	Возврат ОбщийМодуль.ТекстЗапросаОстатков();
	
КонецФункции //- ИнфоСофт Ивонин К.А. 14.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 14.03.24 УА #71892
Процедура УстановитьПараметрыЗапросаОстатков(Маркетплейс, Запрос, Профиль, Склад) Экспорт
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		ИС_Ozon_Сервер.УстановитьПараметрыЗапросаОстатков(Запрос, Профиль, Склад);
		Возврат;
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		ИС_ЯМ_Сервер.УстановитьПараметрыЗапросаОстатков(Запрос, Профиль, Склад);
		Возврат;
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		ИС_Сбер_Сервер.УстановитьПараметрыЗапросаОстатков(Запрос, Профиль, Склад);
		Возврат;
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		ИС_АЛИ_Сервер.УстановитьПараметрыЗапросаОстатков(Запрос, Профиль, Склад);
		Возврат;
	КонецЕсли;
	
	ОбщийМодуль = ИС_МП_Сервер.ОбщийМодульМаркетплейса(Маркетплейс);
	ОбщийМодуль.УстановитьПараметрыЗапросаОстатков(Запрос, Профиль, Склад);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 01.04.24 УА #71892
Функция ПолучитьПоляДляВыгрузки(Маркетплейс) Экспорт
	
	Результат = Новый Массив;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда	
		Результат.Добавить("РазмерWB");
		Результат.Добавить("Штрихкод");	
		Возврат Результат;
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		Результат.Добавить("НоменклатураOzon");
		Результат.Добавить("OfferId");
		Результат.Добавить("ProductId");
		Возврат Результат;	
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		Результат.Добавить("НоменклатураЯМ");
		Результат.Добавить("shopSku");
		Возврат Результат;
	КонецЕсли;
    
    Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		Результат.Добавить("НоменклатураСбер");
		Результат.Добавить("offerID");
		Возврат Результат;	
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		Результат.Добавить("ВариацияAli");
		Результат.Добавить("product_id");
		Результат.Добавить("КодВариации");
		Возврат Результат;	
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.МВМ Тогда
		Результат.Добавить("ТоварМВМ");
		Результат.Добавить("SapМВМ");
		Возврат Результат;	
	КонецЕсли;
	
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода Тогда
		Результат.Добавить("РазмерЛамода");
		Результат.Добавить("SellerSKU");
		Возврат Результат;	
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 01.04.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 02.04.24 УА #71892
Процедура ЗаполнитьКолонкиТаблицыВыгрузкиОстатков(Маркетплейс, ТаблицаЗначений) Экспорт
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда	
		
		ТаблицаЗначений.Колонки.Добавить("РазмерWB"); 
		ТаблицаЗначений.Колонки.Добавить("Штрихкод");
		ТаблицаЗначений.Колонки.Добавить("Остаток", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный));

	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		
		ТаблицаЗначений.Колонки.Добавить("НоменклатураOzon"); 
		ТаблицаЗначений.Колонки.Добавить("OfferId");
		ТаблицаЗначений.Колонки.Добавить("ProductId");
		ТаблицаЗначений.Колонки.Добавить("Остаток", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный));
		
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
	    
	    ТаблицаЗначений.Колонки.Добавить("НоменклатураЯМ"); 
		ТаблицаЗначений.Колонки.Добавить("shopSku");
		ТаблицаЗначений.Колонки.Добавить("Остаток", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный));
	    
	КонецЕсли;
    
    Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
				
		ТаблицаЗначений.Колонки.Добавить("НоменклатураСбер"); 
		ТаблицаЗначений.Колонки.Добавить("offerID");
		ТаблицаЗначений.Колонки.Добавить("Остаток", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный));
				
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
	
		ТаблицаЗначений.Колонки.Добавить("ВариацияAli"); 
		ТаблицаЗначений.Колонки.Добавить("product_id", ОбщегоНазначения.ОписаниеТипаСтрока(30));
		ТаблицаЗначений.Колонки.Добавить("КодВариации", ОбщегоНазначения.ОписаниеТипаСтрока(30));
		ТаблицаЗначений.Колонки.Добавить("Остаток", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный));
		
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.МВМ Тогда
	
		ТаблицаЗначений.Колонки.Добавить("ТоварМВМ"); 
		ТаблицаЗначений.Колонки.Добавить("SapМВМ", ОбщегоНазначения.ОписаниеТипаСтрока(50));
		ТаблицаЗначений.Колонки.Добавить("Остаток", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный));
		
	КонецЕсли;

	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода Тогда
	
		ТаблицаЗначений.Колонки.Добавить("РазмерЛамода"); 
		ТаблицаЗначений.Колонки.Добавить("SellerSKU",  ОбщегоНазначения.ОписаниеТипаСтрока(50));
		ТаблицаЗначений.Колонки.Добавить("Остаток",    ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный));
		
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 02.04.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 14.03.24 УА #71892
Процедура ВыгрузитьОстатки(Маркетплейс, Профиль, Склад, ТаблицаВыгрузки) Экспорт

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда
		ИС_WB_Сервер.ВыгрузитьОстатки(Профиль, Склад, ТаблицаВыгрузки);
		Возврат;
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		ИС_Ozon_Сервер.ВыгрузитьОстатки(Профиль, Склад, ТаблицаВыгрузки);
		Возврат;
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		ИС_ЯМ_Сервер.ВыгрузитьОстатки(Профиль, Склад, ТаблицаВыгрузки);
		Возврат;
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		ИС_Сбер_Сервер.ВыгрузитьОстатки(Профиль, Склад, ТаблицаВыгрузки);
		Возврат;
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		ИС_АЛИ_Сервер.ВыгрузитьОстатки(Профиль, Склад, ТаблицаВыгрузки);
		Возврат;
	КонецЕсли;
	
	ОбщийМодуль = ИС_МП_Сервер.ОбщийМодульМаркетплейса(Маркетплейс);
	ОбщийМодуль.ВыгрузитьОстатки(Профиль, Склад, ТаблицаВыгрузки);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.03.24 УА #71892 

//+ ИнфоСофт Ивонин К.А. 04.03.25 УА #92887
Функция МассивПараметровВыгрузкиОстатков() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("ИспользоватьПоследниеОстатки");
	Результат.Добавить("ИспользоватьФиксированныйОстаток");
	Результат.Добавить("ФиксированныйОстаток");
	Результат.Добавить("РежимСокрытияОстатков");
	Результат.Добавить("СкрываемыйОстаток");
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 04.03.25 УА #92887

//+ ИнфоСофт Ивонин К.А. 04.03.25 УА #92887
Функция СформироватьТаблицуВыгрузки(Профиль, Склад, ПеречислениеМП, Настройки) Экспорт
	
	ОбщийМодуль = ИС_МП_Сервер.ОбщийМодульМаркетплейса(ПеречислениеМП);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаОстатков(ПеречислениеМП);
	ОбщийМодуль.УстановитьПараметрыЗапросаОстатков(Запрос, Профиль, Склад);                                                       
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТаблицаВыгрузки = Новый ТаблицаЗначений;	
	
	ЗаполнитьКолонкиТаблицыВыгрузкиОстатков(ПеречислениеМП, ТаблицаВыгрузки);
	
	МассивПолей = ПолучитьПоляДляВыгрузки(ПеречислениеМП);
		    
    РежимСокрытияОстатков = Ложь;
    ИспользоватьФиксированныйОстаток = Ложь;
    ФиксированныйОстаток = 0;
	
	Если Настройки.РежимСокрытияОстатков <> Неопределено Тогда
		РежимСокрытияОстатков = Настройки.РежимСокрытияОстатков;
	КонецЕсли;

 	Если Настройки.ИспользоватьФиксированныйОстаток <> Неопределено Тогда
		ИспользоватьФиксированныйОстаток = Настройки.ИспользоватьФиксированныйОстаток;
	КонецЕсли;

	Если Настройки.ФиксированныйОстаток <> Неопределено Тогда
		ФиксированныйОстаток = Настройки.ФиксированныйОстаток;
	КонецЕсли;

	Пока Выборка.Следующий() Цикл
	
		Если Не Выборка.ЕстьСопоставление И Не Выборка.ЕстьРучнойОстаток Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаВыгрузки.Добавить();
		
		Прерывать = Ложь;
		
		Для Каждого Элемент Из МассивПолей Цикл
			
			Если Не ЗначениеЗаполнено(Выборка[Элемент]) Тогда
				Прерывать = Истина;
				Прервать;
			КонецЕсли;
			
			НоваяСтрока[Элемент] = Выборка[Элемент];
				
		КонецЦикла;
		
		Если Прерывать Тогда
			Продолжить;	
		КонецЕсли;
		
		Если Выборка.ЕстьРучнойОстаток Тогда
			НоваяСтрока.Остаток = Выборка.РучнойОстаток;
		Иначе
		
			СкрываемыйОстаток = 0;
				
			Если РежимСокрытияОстатков Тогда
				СкрываемыйОстаток = Выборка.Свободно * Выборка.СкрываемыйОстаток / 100;
			Иначе
				СкрываемыйОстаток = Выборка.СкрываемыйОстаток;
			КонецЕсли;
						
			Если Выборка.Свободно > СкрываемыйОстаток Тогда
				НоваяСтрока.Остаток = Выборка.Свободно - СкрываемыйОстаток;  
			Иначе
				НоваяСтрока.Остаток = 0;
			КонецЕсли;
			 										
			Если ИспользоватьФиксированныйОстаток Тогда
	
				Если НоваяСтрока.Остаток > ФиксированныйОстаток Тогда
					НоваяСтрока.Остаток = ФиксированныйОстаток;	
				КонецЕсли; 
				
			КонецЕсли;

		КонецЕсли;
		
		Если Цел(НоваяСтрока.Остаток) <> НоваяСтрока.Остаток Тогда
			НоваяСтрока.Остаток = Окр(НоваяСтрока.Остаток, 0, РежимОкругления.Окр15как10); 
		КонецЕсли;
		
		//Если Не Выборка.ЕстьРучнойОстаток И Выборка.ЕстьПоследнийВыгруженныйОстаток И НоваяСтрока.Остаток = Выборка.ПоследнийВыгруженныйОстаток Тогда
		//	ТаблицаВыгрузки.Удалить(НоваяСтрока);
		//	Продолжить;	
		//КонецЕсли;
	
	КонецЦикла;
	
	Возврат ТаблицаВыгрузки;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 04.03.25 УА #92887

//+ ИнфоСофт Ивонин К.А. 04.03.25 УА #92887
Функция МассивНастроекОстатков(Маркетплейс) Экспорт
	ОбщийМодуль = ИС_МП_Сервер.ОбщийМодульМаркетплейса(Маркетплейс);
	Возврат ОбщийМодуль.МассивНастроекОстатков();
КонецФункции //- ИнфоСофт Ивонин К.А. 04.03.25 УА #92887

#Область ВнешниеИсточникиОстатков

//+ ИнфоСофт Ивонин К.А. 22.07.24 УА #77582
Процедура ЗагрузитьДанныеИзВнешнегоИсточника(Источник) Экспорт
    
    Событие = ИмяСобытия("ЗагрузитьОстаткиИзВнешнегоИсточника"); 
    	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_МП_ВнешниеИсточникиОстатков.Склад КАК Склад,
	|	ИС_МП_ВнешниеИсточникиОстатков.ФорматДанных КАК ФорматДанных,
	|	ИС_МП_ВнешниеИсточникиОстатков.АдресСервиса КАК АдресСервиса,
	|	ИС_МП_ВнешниеИсточникиОстатков.ПолеСопоставления КАК ПолеСопоставления,
	|	ИС_МП_ВнешниеИсточникиОстатков.ПолеОстатка КАК ПолеОстатка,
	|	ИС_МП_ВнешниеИсточникиОстатков.ПолеЦены КАК ПолеЦены,
	|	ИС_МП_ВнешниеИсточникиОстатков.СоставЗагружаемыхДанных КАК СоставЗагружаемыхДанных,
	|	ИС_МП_ВнешниеИсточникиОстатков.ВидЦены КАК ВидЦены,
	|	ИС_МП_ВнешниеИсточникиОстатков.ПерваяСтрока КАК ПерваяСтрока,
	|	ИС_МП_ВнешниеИсточникиОстатков.ПерваяКолонка КАК ПерваяКолонка,
	|	ИС_МП_ВнешниеИсточникиОстатков.ПоследняяСтрока КАК ПоследняяСтрока,
	|	ИС_МП_ВнешниеИсточникиОстатков.ПоследняяКолонка КАК ПоследняяКолонка,
	|	ИС_МП_ВнешниеИсточникиОстатков.СопоставлятьПо КАК СопоставлятьПо
	|ИЗ
	|	Справочник.ИС_МП_ВнешниеИсточникиОстатков КАК ИС_МП_ВнешниеИсточникиОстатков
	|ГДЕ
	|	ИС_МП_ВнешниеИсточникиОстатков.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Источник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИсточник = РезультатЗапроса.Выбрать();
	
	Если РезультатЗапроса.Пустой() Тогда
		ТекстОшибки = "Не найден источник информации об остатках";
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ВыборкаИсточник.Следующий();
	
	Если Не ЗначениеЗаполнено(ВыборкаИсточник.ПолеСопоставления) Тогда
		ТекстОшибки = "Не заполнено поле сопоставления";
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстОшибки);
		Возврат;
	КонецЕсли;

	ЗагружатьОстатки = Истина;	
	ЗагружатьЦены = Истина;
	ТекстОшибки = "";
	
	Если ВыборкаИсточник.СоставЗагружаемыхДанных = 0 Или ВыборкаИсточник.СоставЗагружаемыхДанных = 2 Тогда
		
		Если Не ЗначениеЗаполнено(ВыборкаИсточник.Склад) Тогда
			ЗагружатьОстатки = Ложь;
			ТекстОшибки = "Не заполнен ""Склад""" + Символы.ПС;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВыборкаИсточник.ПолеОстатка) Тогда
			ЗагружатьОстатки = Ложь;
			ТекстОшибки = ТекстОшибки + "Не заполнено ""Поле остатка""" + Символы.ПС ;
		КонецЕсли;
	
	КонецЕсли;
	
	Если ВыборкаИсточник.СоставЗагружаемыхДанных = 1 Или ВыборкаИсточник.СоставЗагружаемыхДанных = 2 Тогда
		
		Если Не ЗначениеЗаполнено(ВыборкаИсточник.ВидЦены) Тогда
			ЗагружатьЦены = Ложь;
			ТекстОшибки = ТекстОшибки + "Не заполнен ""Вид цены""" + Символы.ПС;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВыборкаИсточник.ПолеЦены) Тогда
			ЗагружатьЦены = Ложь;
			ТекстОшибки = ТекстОшибки + "Не заполнено ""Поле цены""" + Символы.ПС;
		КонецЕсли;
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстОшибки);
	КонецЕсли;
	
	Если Не ЗагружатьОстатки И Не ЗагружатьЦены Тогда
		Возврат;
	КонецЕсли; 
    
    ПараметрыЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ПолучитьСтруктуруHTTPЗапроса();
    ЗаполнитьЗначенияСвойств(ПараметрыЗапроса,
    	ИС_MP_РаботаСHTTPЗапросамиСервер.РазобратьURLНаПараметрыЗапроса(ВыборкаИсточник.АдресСервиса));
    
	ПараметрыЗапроса.Вставить("ФорматОтвета", "ДвоичныеДанные");
	
	РезультатЗапроса = ИС_MP_РаботаСHTTPЗапросамиСервер.ОтправитьGETЗапрос(ПараметрыЗапроса);
		
	Если РезультатЗапроса.ЕстьОшибки Тогда
		Текст = СтрШаблон("Произошла ошибка при отправке запроса: %1",	РезультатЗапроса.ИнформацияОбОшибке.Описание);
		ОбщегоНазначения.СообщитьПользователю(Текст); 	
	Иначе
	
		Если РезультатЗапроса.КодОтвета = 200 Тогда
            
            Адрес = ПоместитьВоВременноеХранилище(РезультатЗапроса.Ответ);   
			
		ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
             
            Текст = СтрШаблон("Неверная форма запроса: %1", РезультатЗапроса.Ответ); 
      		ОбщегоНазначения.СообщитьПользователю(Текст);
	      					
		Иначе
			Текст = СтрШаблон("Произошла неизвестная ошибка, код ответа: %1, ошибка: %2", 
				РезультатЗапроса.КодОтвета, РезультатЗапроса.Ответ);			
			ОбщегоНазначения.СообщитьПользователю(Текст);	
				
		КонецЕсли;
			
	КонецЕсли;
	
	Если Адрес = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыТаблицы = Новый Структура;
	ПараметрыТаблицы.Вставить("ПерваяСтрока", ВыборкаИсточник.ПерваяСтрока);
	ПараметрыТаблицы.Вставить("ПерваяКолонка", ВыборкаИсточник.ПерваяКолонка);
	ПараметрыТаблицы.Вставить("ПоследняяСтрока", ВыборкаИсточник.ПоследняяСтрока);
	ПараметрыТаблицы.Вставить("ПоследняяКолонка", ВыборкаИсточник.ПоследняяКолонка);
    
    Результат = ИС_MP_Сервер.ПолучитьТаблицуЗначенийИзExcel(Адрес, ПараметрыТаблицы);
    
    ТаблицаОстатков = Новый ТаблицаЗначений;
    ТаблицаОстатков.Колонки.Добавить("Идентификатор", ОбщегоНазначения.ОписаниеТипаСтрока(250));
    ТаблицаОстатков.Колонки.Добавить("Остаток", ОбщегоНазначения.ОписаниеТипаСтрока(10));
    ТаблицаОстатков.Колонки.Добавить("Цена", ОбщегоНазначения.ОписаниеТипаСтрока(250));
    
    Для Каждого Строка Из Результат Цикл
    
    	Если Не ЗначениеЗаполнено(Строка[ВыборкаИсточник.ПолеСопоставления]) Тогда
    		Продолжить;
    	КонецЕсли;
    	
    	НоваяСтрока = ТаблицаОстатков.Добавить();
    	
    	НоваяСтрока.Идентификатор = Строка[ВыборкаИсточник.ПолеСопоставления];
    	НоваяСтрока.Остаток = Строка[ВыборкаИсточник.ПолеОстатка];
    	НоваяСтрока.Цена = Строка[ВыборкаИсточник.ПолеЦены];
    
    КонецЦикла;
    
    Запрос = Новый Запрос;
    
    Если ВыборкаИсточник.СопоставлятьПо = "Баркод" Тогда
	   	
	   	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеВИ.Идентификатор КАК Идентификатор,
		|	ДанныеВИ.Остаток КАК Остаток,
		|	ДанныеВИ.Цена КАК Цена
		|ПОМЕСТИТЬ ВТ_ДанныеВИ
		|ИЗ
		|	&ДанныеВИ КАК ДанныеВИ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеВИ.Идентификатор КАК Идентификатор,
		|	ВТ_ДанныеВИ.Остаток КАК Остаток,
		|	ВТ_ДанныеВИ.Цена КАК Цена,
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
		|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка,
		|	ВЫБОР
		|		КОГДА ШтрихкодыНоменклатуры.Характеристика ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)
		|		ИНАЧЕ ШтрихкодыНоменклатуры.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования
		|	КОНЕЦ КАК ХарактеристикаЦО
		|ИЗ
		|	ВТ_ДанныеВИ КАК ВТ_ДанныеВИ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО ВТ_ДанныеВИ.Идентификатор = ШтрихкодыНоменклатуры.Штрихкод";
		
	ИначеЕсли ВыборкаИсточник.СопоставлятьПо = "Артикул" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеВИ.Идентификатор КАК Идентификатор,
		|	ДанныеВИ.Остаток КАК Остаток,
		|	ДанныеВИ.Цена КАК Цена
		|ПОМЕСТИТЬ ВТ_ДанныеВИ
		|ИЗ
		|	&ДанныеВИ КАК ДанныеВИ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеВИ.Идентификатор КАК Идентификатор,
		|	ВТ_ДанныеВИ.Остаток КАК Остаток,
		|	ВТ_ДанныеВИ.Цена КАК Цена,
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка) КАК ХарактеристикаЦО,
		|	Номенклатура.ЕдиницаИзмерения КАК Упаковка
		|ИЗ
		|	ВТ_ДанныеВИ КАК ВТ_ДанныеВИ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО ВТ_ДанныеВИ.Идентификатор = Номенклатура.Артикул";
	
	Иначе

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеВИ.Идентификатор КАК Идентификатор,
		|	ДанныеВИ.Остаток КАК Остаток,
		|	ДанныеВИ.Цена КАК Цена
		|ПОМЕСТИТЬ ВТ_ДанныеВИ
		|ИЗ
		|	&ДанныеВИ КАК ДанныеВИ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеВИ.Идентификатор КАК Идентификатор,
		|	ВТ_ДанныеВИ.Остаток КАК Остаток,
		|	ВТ_ДанныеВИ.Цена КАК Цена,
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка) КАК ХарактеристикаЦО,
		|	Номенклатура.ЕдиницаИзмерения КАК Упаковка
		|ИЗ
		|	ВТ_ДанныеВИ КАК ВТ_ДанныеВИ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО ВТ_ДанныеВИ.Идентификатор = Номенклатура.Наименование";
	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДанныеВИ", ТаблицаОстатков);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если ЗагружатьОстатки Тогда
	
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
			
				НоваяЗапись = РегистрыСведений.ИС_МП_ВнешниеОстатки.СоздатьМенеджерЗаписи();
				
				НоваяЗапись.Склад = ВыборкаИсточник.Склад;
				НоваяЗапись.Номенклатура = Выборка.Номенклатура;
				НоваяЗапись.Источник = Источник;
				НоваяЗапись.Характеристика = Выборка.Характеристика;
				НоваяЗапись.Остаток = ИС_МП_КлиентСервер.ПреобразоватьКЧислу(Выборка.Остаток);
			    НоваяЗапись.Записать(Истина);
			    
			КонецЕсли;
				
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗагружатьЦены Тогда
	
		УстановкаЦен = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
		УстановкаЦен.Дата = ТекущаяДатаСеанса();
		УстановкаЦен.Комментарий = "Создан на основании загрузки данных из внешних источников:" + Источник;
		УстановкаЦен.Согласован = Истина;
		УстановкаЦен.Статус = Перечисления.СтатусыУстановокЦенНоменклатуры.Согласован;
		
		Выборка.Сбросить();
		
		ВалютаУчета = Константы.ВалютаУправленческогоУчета.Получить();
		
		НоваяСтрока = УстановкаЦен.ВидыЦен.Добавить();
		НоваяСтрока.ВидЦены = ВыборкаИсточник.ВидЦены; 
		
		Если Константы.ИспользуетсяЦенообразование25.Получить() Тогда
		
			Пока Выборка.Следующий() Цикл
				
				Если ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
				
					НоваяСтрока = УстановкаЦен.Товары2_5.Добавить();
					
					НоваяСтрока.Номенклатура = Выборка.Номенклатура;
					НоваяСтрока.ХарактеристикаЦО = Выборка.ХарактеристикаЦО;
					//НоваяСтрока.СерияЦО = Выборка.СерияЦО;
					//НоваяСтрока.УпаковкаЦО = Выборка.УпаковкаЦО;
					НоваяСтрока.Упаковка = Выборка.Упаковка;
					НоваяСтрока.ВидЦены = ВыборкаИсточник.ВидЦены;
					НоваяСтрока.Цена = ИС_МП_КлиентСервер.ПреобразоватьКЧислу(Выборка.Цена); 
					НоваяСтрока.ЦенаИзмененаВручную = Истина; 
					НоваяСтрока.Валюта = ВалютаУчета;
						    
				КонецЕсли;
					
			КонецЦикла;
		
		Иначе
		 
			Пока Выборка.Следующий() Цикл
				
				Если ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
				
					НоваяСтрока = УстановкаЦен.Товары.Добавить();
					
					НоваяСтрока.Номенклатура = Выборка.Номенклатура;
					НоваяСтрока.Характеристика = Выборка.Характеристика;
					НоваяСтрока.Упаковка = Выборка.Упаковка;
					НоваяСтрока.ВидЦены = ВыборкаИсточник.ВидЦены;
					НоваяСтрока.Цена = ИС_МП_КлиентСервер.ПреобразоватьКЧислу(Выборка.Цена); 
					НоваяСтрока.ЦенаИзмененаВручную = Истина; 
					НоваяСтрока.Валюта = ВалютаУчета;
						    
				КонецЕсли;
					
			КонецЦикла;
		
		КонецЕсли;
		
		Попытка
			УстановкаЦен.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ТекстОшибки = ИС_MP_Сервер.ПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстОшибки);	
		КонецПопытки;
	
	КонецЕсли;
    
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.07.24 УА #77582	

#КонецОбласти

#Область Остатки
	
//+ ИнфоСофт Мурсалимов Д.Р. 01.03.24 УА #67173
// На вход требуется временная таблица "ВТ_Сопоставление", которая сожержит 4 обязательных поля:
// 		ПолеСопоставление - поле которое будет использовано для соединения в финальном пакете
//		Номенклатура - Номенклатура для получения остатков
//		Характеристика - Характеристика для получения остатков
// 		КоэффициентУпаковки - Коэффициент вычисленный из значений числитель / знаминатель упаковки
//
// Также имеются следующие обязательные параметры дял установки:
//		КоличествоСкрываемогоОстатка - Количество скрываемого остатка из настроек профиля
//		РассчитыватьНесобранныеКомплекты - Признак необходимости рассчета несобранных комплектов из настроек профиля
//		Склад1С - Определяет склад, список складов или Группу складов. В случае использования группы складов
//		необходимо сделать замену %1 в тексте на "ИЕРАРХИИ", в остальных случаях на ""
//
// Возвращаемое значение:
//  Строка - Текст запроса остатков
//
Функция ТекстЗапросаОстатков() Экспорт
	
	Версия = ИС_МП_Сервер.ВерсияБезРедакции();
	ИмяКонфигурации = ИС_МП_Сервер.ИмяКонфигурации();
	
	Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлючиАналитикиУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	КлючиАналитикиУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	ТоварыОрганизацийОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	0 КАК ВРезервеОстаток,
	|	0 КАК КОтгрузкеОстаток
	|ПОМЕСТИТЬ ВТ_СвободныеОстаткиОрганизации
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(, Организация = &Организация) КАК ТоварыОрганизацийОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|		ПО ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|ГДЕ
	|	&ВыгружатьОстаткиВРазрезеОрганизации
	|	И КлючиАналитикиУчетаНоменклатуры.СкладскаяТерритория В ИЕРАРХИИ(&Склад1С)
	//+ ИнфоСофт Власова И.С. 14.03.25 УА #95727
	|	И КлючиАналитикиУчетаНоменклатуры.Назначение В(&Назначение)
	//- ИнфоСофт Власова И.С. 14.03.25 УА #95727
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыКОтгрузкеОстатки.Номенклатура,
	|	ТоварыКОтгрузкеОстатки.Характеристика,
	|	0,
	|	ТоварыКОтгрузкеОстатки.ВРезервеОстаток,
	|	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(
	|			,
	|			Склад В ИЕРАРХИИ (&Склад1С)
	//+ ИнфоСофт Власова И.С. 14.03.25 УА #95727
	//|				И ДокументОтгрузки.Организация = &Организация) КАК ТоварыКОтгрузкеОстатки
	|				И ДокументОтгрузки.Организация = &Организация
	|				И Назначение В(&Назначение)) КАК ТоварыКОтгрузкеОстатки
	//- ИнфоСофт Власова И.С. 14.03.25 УА #95727
	|ГДЕ
	|	&ВыгружатьОстаткиВРазрезеОрганизации
	//+ ИнфоСофт Власова И.С. 14.03.25 УА #95727
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаспределениеЗапасов.Номенклатура,
	|	РаспределениеЗапасов.Характеристика,
	|	СУММА(0),
	|	СУММА(РаспределениеЗапасов.Зарезервировано),
	|	СУММА(0)
	|ИЗ
	|	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|ГДЕ
	|	(РаспределениеЗапасов.Номенклатура, РаспределениеЗапасов.Характеристика) В
	|			(ВЫБРАТЬ
	|				ВТ.Номенклатура КАК Номенклатура,
	|				ВТ.Характеристика КАК Характеристика
	|			ИЗ
	|				ВТ_Сопоставление КАК ВТ
	|			ГДЕ
	|				ВТ.ЕстьСопоставление)
	|	И РаспределениеЗапасов.Склад В ИЕРАРХИИ(&Склад1С)
	|	И РаспределениеЗапасов.Назначение В(&Назначение)";
	
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(Версия, "5.17.00") >= 0 Тогда
		Текст = Текст + " 
		|	И РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ЗарезервированПриПоступлении)";	
	Иначе
		Текст = Текст + "
		|	И РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе)";
	КонецЕсли;
	
	Текст = Текст + "
	|	И РаспределениеЗапасов.ЗаказНаОтгрузку ССЫЛКА Документ.ЗаказКлиента
	|	И ВЫРАЗИТЬ(РаспределениеЗапасов.ЗаказНаОтгрузку КАК Документ.ЗаказКлиента).Организация = &Организация
	|	И &ВыгружатьОстаткиВРазрезеОрганизации
	|	
	|СГРУППИРОВАТЬ ПО
	|	РаспределениеЗапасов.Номенклатура,
	|	РаспределениеЗапасов.Характеристика
	//- ИнфоСофт Власова И.С. 14.03.25 УА #95727
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_МП_ВнешниеОстатки.Номенклатура КАК Номенклатура,
	|	ИС_МП_ВнешниеОстатки.Характеристика КАК Характеристика,
	|	СУММА(ИС_МП_ВнешниеОстатки.Остаток) КАК Остаток
	|ПОМЕСТИТЬ ВТ_ВнешниеОстатки
	|ИЗ
	|	РегистрСведений.ИС_МП_ВнешниеОстатки КАК ИС_МП_ВнешниеОстатки
	|ГДЕ
	|	ИС_МП_ВнешниеОстатки.Склад В ИЕРАРХИИ(&Склад1С)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_МП_ВнешниеОстатки.Номенклатура,
	|	ИС_МП_ВнешниеОстатки.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
	|	РаспределениеЗапасов.Характеристика КАК Характеристика,
	|	СУММА(РаспределениеЗапасов.Свободно) КАК Свободно,";
	
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(Версия, "5.21.00") >= 0 
			Или (ИмяКонфигурации = "УправлениеТорговлей_CRM_2" 
			И ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(Версия, "1.32.11") >= 0) Тогда
			
		Текст = Текст + "
		//+ ИнфоСофт Власова И.С. 14.03.25 УА #95727
		//|	СУММА(РаспределениеЗапасов.РезервироватьНаСкладеПоВсемЗаказамСводно) КАК Резерв";
		|	СУММА(РаспределениеЗапасов.РезервироватьНаСкладеПоВсемЗаказамСводно + РаспределениеЗапасов.Зарезервировано) КАК Резерв";
		//- ИнфоСофт Власова И.С. 14.03.25 УА #95727
	Иначе
		Текст = Текст + "
		//+ ИнфоСофт Власова И.С. 14.03.25 УА #95727
		//|	СУММА(РаспределениеЗапасов.Резерв) КАК Резерв";
		|	СУММА(РаспределениеЗапасов.Резерв + РаспределениеЗапасов.Зарезервировано) КАК Резерв";
		//- ИнфоСофт Власова И.С. 14.03.25 УА #95727
	КонецЕсли;
	
	Текст = Текст + "
	|ПОМЕСТИТЬ ВТ_ОстаткиТоваров
	|ИЗ
	|	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|ГДЕ
	|	(РаспределениеЗапасов.Номенклатура, РаспределениеЗапасов.Характеристика) В
	|			(ВЫБРАТЬ
	|				ВТ.Номенклатура КАК Номенклатура,
	|				ВТ.Характеристика КАК Характеристика
	|			ИЗ
	|				ВТ_Сопоставление КАК ВТ
	|			ГДЕ
	|				ВТ.ЕстьСопоставление)
	|	И РаспределениеЗапасов.Склад В ИЕРАРХИИ(&Склад1С)
	|	И РаспределениеЗапасов.Назначение В(&Назначение)
	//+ ИнфоСофт Власова И.С. 14.03.25 УА #95727
	//|	И РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
	|	И РаспределениеЗапасов.Состояние В(ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе),";
	
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(Версия, "5.17.00") >= 0 Тогда
		Текст = Текст + " 
		|		ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ЗарезервированПриПоступлении))";	
	Иначе
		Текст = Текст + "
		|		ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе))";
	КонецЕсли;
	
	Текст = Текст + "
	//- ИнфоСофт Власова И.С. 14.03.25 УА #95727
	|	И НЕ &ВыгружатьОстаткиВРазрезеОрганизации
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспределениеЗапасов.Номенклатура,
	|	РаспределениеЗапасов.Характеристика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_СвободныеОстаткиОрганизации.Номенклатура,
	|	ВТ_СвободныеОстаткиОрганизации.Характеристика,
	|	СУММА(ВТ_СвободныеОстаткиОрганизации.КоличествоОстаток - ВТ_СвободныеОстаткиОрганизации.ВРезервеОстаток - ВТ_СвободныеОстаткиОрганизации.КОтгрузкеОстаток),
	|	СУММА(ВТ_СвободныеОстаткиОрганизации.ВРезервеОстаток)
	|ИЗ
	|	ВТ_СвободныеОстаткиОрганизации КАК ВТ_СвободныеОстаткиОрганизации
	|ГДЕ
	|	(ВТ_СвободныеОстаткиОрганизации.Номенклатура, ВТ_СвободныеОстаткиОрганизации.Характеристика) В
	|			(ВЫБРАТЬ
	|				ВТ.Номенклатура КАК Номенклатура,
	|				ВТ.Характеристика КАК Характеристика
	|			ИЗ
	|				ВТ_Сопоставление КАК ВТ
	|			ГДЕ
	|				ВТ.ЕстьСопоставление)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СвободныеОстаткиОрганизации.Характеристика,
	|	ВТ_СвободныеОстаткиОрганизации.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВнешниеОстатки.Номенклатура,
	|	ВТ_ВнешниеОстатки.Характеристика,
	|	ВТ_ВнешниеОстатки.Остаток,
	|	0
	|ИЗ
	|	ВТ_ВнешниеОстатки КАК ВТ_ВнешниеОстатки
	|ГДЕ
	|	НЕ &ВыгружатьОстаткиВРазрезеОрганизации
	|	И (ВТ_ВнешниеОстатки.Номенклатура, ВТ_ВнешниеОстатки.Характеристика) В
	|			(ВЫБРАТЬ
	|				ВТ.Номенклатура,
	|				ВТ.Характеристика
	|			ИЗ
	|				ВТ_Сопоставление КАК ВТ
	|			ГДЕ
	|				ВТ.ЕстьСопоставление)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВариантыКомплектацииНоменклатуры.Владелец КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатуры.Характеристика КАК Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК НоменклатураНабора,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК ХарактеристикаНабора,
	|	СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество) КАК КоличествоНабора
	|ПОМЕСТИТЬ ВТ_СоставНаборов
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	|		ПО ВариантыКомплектацииНоменклатурыТовары.Ссылка = ВариантыКомплектацииНоменклатуры.Ссылка
	|ГДЕ
	|	(ВариантыКомплектацииНоменклатуры.Владелец, ВариантыКомплектацииНоменклатуры.Характеристика) В
	|			(ВЫБРАТЬ
	|				ВТ.Номенклатура КАК Номенклатура,
	|				ВТ.Характеристика КАК Характеристика
	|			ИЗ
	|				ВТ_Сопоставление КАК ВТ
	|			ГДЕ
	|				ВТ.ЭтоНабор)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВариантыКомплектацииНоменклатуры.Владелец,
	|	ВариантыКомплектацииНоменклатуры.Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_СоставНаборов.Номенклатура КАК Номенклатура,
	|	ВТ_СоставНаборов.Характеристика КАК Характеристика,
	|	ВТ_СоставНаборов.НоменклатураНабора КАК НоменклатураНабора,
	|	ВТ_СоставНаборов.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ВТ_СоставНаборов.КоличествоНабора КАК КоличествоНабора,
	|	СУММА(ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) + ЕСТЬNULL(ВТ_ВнешниеОстатки.Остаток, 0)) КАК Свободно
	|ПОМЕСТИТЬ ВТ_ОстаткиСоставаНаборов
	|ИЗ
	|	ВТ_СоставНаборов КАК ВТ_СоставНаборов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|		ПО ВТ_СоставНаборов.НоменклатураНабора = РаспределениеЗапасов.Номенклатура
	|			И ВТ_СоставНаборов.ХарактеристикаНабора = РаспределениеЗапасов.Характеристика
	|			И (РаспределениеЗапасов.Склад В ИЕРАРХИИ (&Склад1С))
	|			И (РаспределениеЗапасов.Назначение В (&Назначение))
	|			И (РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВнешниеОстатки КАК ВТ_ВнешниеОстатки
	|		ПО ВТ_СоставНаборов.НоменклатураНабора = ВТ_ВнешниеОстатки.Номенклатура
	|			И ВТ_СоставНаборов.ХарактеристикаНабора = ВТ_ВнешниеОстатки.Характеристика
	|ГДЕ
	|	НЕ &ВыгружатьОстаткиВРазрезеОрганизации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СоставНаборов.Номенклатура,
	|	ВТ_СоставНаборов.Характеристика,
	|	ВТ_СоставНаборов.НоменклатураНабора,
	|	ВТ_СоставНаборов.ХарактеристикаНабора,
	|	ВТ_СоставНаборов.КоличествоНабора
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_СоставНаборов.Номенклатура,
	|	ВТ_СоставНаборов.Характеристика,
	|	ВТ_СоставНаборов.НоменклатураНабора,
	|	ВТ_СоставНаборов.ХарактеристикаНабора,
	|	ВТ_СоставНаборов.КоличествоНабора,
	|	ЕСТЬNULL(ВТ_СвободныеОстаткиОрганизации.КоличествоОстаток - ВТ_СвободныеОстаткиОрганизации.ВРезервеОстаток - ВТ_СвободныеОстаткиОрганизации.КОтгрузкеОстаток, 0)
	|ИЗ
	|	ВТ_СоставНаборов КАК ВТ_СоставНаборов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвободныеОстаткиОрганизации КАК ВТ_СвободныеОстаткиОрганизации
	|		ПО ВТ_СоставНаборов.НоменклатураНабора = ВТ_СвободныеОстаткиОрганизации.Номенклатура
	|			И ВТ_СоставНаборов.ХарактеристикаНабора = ВТ_СвободныеОстаткиОрганизации.Характеристика
	|ГДЕ
	|	&ВыгружатьОстаткиВРазрезеОрганизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВариантыКомплектацииНоменклатуры.Ссылка КАК ВариантКомплектации,
	|	ВариантыКомплектацииНоменклатуры.Владелец КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатуры.Характеристика КАК Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК НоменклатураКомплекта,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК ХарактеристикаКомплекта,
	|	СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество) КАК КоличествоКомплекта
	|ПОМЕСТИТЬ ВТ_СоставКомплектов
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	|		ПО ВариантыКомплектацииНоменклатурыТовары.Ссылка = ВариантыКомплектацииНоменклатуры.Ссылка
	|ГДЕ
	|	(ВариантыКомплектацииНоменклатуры.Владелец, ВариантыКомплектацииНоменклатуры.Характеристика) В
	|			(ВЫБРАТЬ
	|				ВТ.Номенклатура КАК Номенклатура,
	|				ВТ.Характеристика КАК Характеристика
	|			ИЗ
	|				ВТ_Сопоставление КАК ВТ
	|			ГДЕ
	|				НЕ ВТ.ЭтоНабор)
	|	И &РассчитыватьНесобранныеКомплекты
	|	И НЕ ВариантыКомплектацииНоменклатуры.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ВариантыКомплектацииНоменклатуры.Ссылка,
	|	ВариантыКомплектацииНоменклатуры.Владелец,
	|	ВариантыКомплектацииНоменклатуры.Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_СоставКомплектов.ВариантКомплектации КАК ВариантКомплектации,
	|	ВТ_СоставКомплектов.Номенклатура КАК Номенклатура,
	|	ВТ_СоставКомплектов.Характеристика КАК Характеристика,
	|	ВТ_СоставКомплектов.НоменклатураКомплекта КАК НоменклатураКомплекта,
	|	ВТ_СоставКомплектов.ХарактеристикаКомплекта КАК ХарактеристикаКомплекта,
	|	ВТ_СоставКомплектов.КоличествоКомплекта КАК КоличествоКомплекта,
	|	СУММА(ЕСТЬNULL(РаспределениеЗапасов.Свободно, 0) + ЕСТЬNULL(ВТ_ВнешниеОстатки.Остаток, 0)) КАК Свободно
	|ПОМЕСТИТЬ ВТ_ОстаткиСоставаКомплектов
	|ИЗ
	|	ВТ_СоставКомплектов КАК ВТ_СоставКомплектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|		ПО ВТ_СоставКомплектов.НоменклатураКомплекта = РаспределениеЗапасов.Номенклатура
	|			И ВТ_СоставКомплектов.ХарактеристикаКомплекта = РаспределениеЗапасов.Характеристика
	|			И (РаспределениеЗапасов.Склад В ИЕРАРХИИ (&Склад1С))
	|			И (РаспределениеЗапасов.Назначение В (&Назначение))
	|			И (РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВнешниеОстатки КАК ВТ_ВнешниеОстатки
	|		ПО ВТ_СоставКомплектов.НоменклатураКомплекта = ВТ_ВнешниеОстатки.Номенклатура
	|			И ВТ_СоставКомплектов.ХарактеристикаКомплекта = ВТ_ВнешниеОстатки.Характеристика
	|ГДЕ
	|	НЕ &ВыгружатьОстаткиВРазрезеОрганизации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СоставКомплектов.ВариантКомплектации,
	|	ВТ_СоставКомплектов.Номенклатура,
	|	ВТ_СоставКомплектов.Характеристика,
	|	ВТ_СоставКомплектов.НоменклатураКомплекта,
	|	ВТ_СоставКомплектов.ХарактеристикаКомплекта,
	|	ВТ_СоставКомплектов.КоличествоКомплекта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_СоставКомплектов.ВариантКомплектации,
	|	ВТ_СоставКомплектов.Номенклатура,
	|	ВТ_СоставКомплектов.Характеристика,
	|	ВТ_СоставКомплектов.НоменклатураКомплекта,
	|	ВТ_СоставКомплектов.ХарактеристикаКомплекта,
	|	ВТ_СоставКомплектов.КоличествоКомплекта,
	|	ЕСТЬNULL(ВТ_СвободныеОстаткиОрганизации.КоличествоОстаток - ВТ_СвободныеОстаткиОрганизации.ВРезервеОстаток - ВТ_СвободныеОстаткиОрганизации.КОтгрузкеОстаток, 0)
	|ИЗ
	|	ВТ_СоставКомплектов КАК ВТ_СоставКомплектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвободныеОстаткиОрганизации КАК ВТ_СвободныеОстаткиОрганизации
	|		ПО ВТ_СоставКомплектов.НоменклатураКомплекта = ВТ_СвободныеОстаткиОрганизации.Номенклатура
	|			И ВТ_СоставКомплектов.ХарактеристикаКомплекта = ВТ_СвободныеОстаткиОрганизации.Характеристика
	|ГДЕ
	|	&ВыгружатьОстаткиВРазрезеОрганизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиСоставаНаборов.Номенклатура КАК Номенклатура,
	|	ВТ_ОстаткиСоставаНаборов.Характеристика КАК Характеристика,
	|	МИНИМУМ(ВЫРАЗИТЬ(ВТ_ОстаткиСоставаНаборов.Свободно / ВТ_ОстаткиСоставаНаборов.КоличествоНабора - 0.5 КАК ЧИСЛО(10, 0))) КАК Остаток
	|ПОМЕСТИТЬ ВТ_ОстаткиНаборов
	|ИЗ
	|	ВТ_ОстаткиСоставаНаборов КАК ВТ_ОстаткиСоставаНаборов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиСоставаНаборов.Номенклатура,
	|	ВТ_ОстаткиСоставаНаборов.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиСоставаКомплектов.Номенклатура КАК Номенклатура,
	|	ВТ_ОстаткиСоставаКомплектов.Характеристика КАК Характеристика,
	|	МИНИМУМ(ВЫРАЗИТЬ(ВТ_ОстаткиСоставаКомплектов.Свободно / ВТ_ОстаткиСоставаКомплектов.КоличествоКомплекта - 0.5 КАК ЧИСЛО(10, 0))) КАК Остаток
	|ПОМЕСТИТЬ ВТ_ОстаткиКомплектов
	|ИЗ
	|	ВТ_ОстаткиСоставаКомплектов КАК ВТ_ОстаткиСоставаКомплектов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиСоставаКомплектов.ВариантКомплектации,
	|	ВТ_ОстаткиСоставаКомплектов.Номенклатура,
	|	ВТ_ОстаткиСоставаКомплектов.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиТоваров.Номенклатура КАК Номенклатура,
	|	ВТ_ОстаткиТоваров.Характеристика КАК Характеристика,
	|	ВТ_ОстаткиТоваров.Свободно КАК Свободно,
	|	ВТ_ОстаткиТоваров.Резерв КАК Резерв
	|ПОМЕСТИТЬ ВТ_ОстаткиОбъединение
	|ИЗ
	|	ВТ_ОстаткиТоваров КАК ВТ_ОстаткиТоваров
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ОстаткиНаборов.Номенклатура,
	|	ВТ_ОстаткиНаборов.Характеристика,
	|	ВТ_ОстаткиНаборов.Остаток,
	|	0
	|ИЗ
	|	ВТ_ОстаткиНаборов КАК ВТ_ОстаткиНаборов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ОстаткиКомплектов.Номенклатура,
	|	ВТ_ОстаткиКомплектов.Характеристика,
	|	ВТ_ОстаткиКомплектов.Остаток,
	|	0
	|ИЗ
	|	ВТ_ОстаткиКомплектов КАК ВТ_ОстаткиКомплектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сопоставление.ПолеСопоставления КАК ПолеСопоставления,
	|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
	|	ВТ_Сопоставление.Характеристика КАК Характеристика,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ_ОстаткиОбъединение.Свободно, 0) / ВТ_Сопоставление.КоэффициентУпаковки - 0.5 < 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОстаткиОбъединение.Свободно, 0) / ВТ_Сопоставление.КоэффициентУпаковки - 0.5 КАК ЧИСЛО(10, 0))
	|		КОНЕЦ) КАК Свободно,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ_ОстаткиОбъединение.Резерв, 0) / ВТ_Сопоставление.КоэффициентУпаковки - 0.5 < 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОстаткиОбъединение.Резерв, 0) / ВТ_Сопоставление.КоэффициентУпаковки - 0.5 КАК ЧИСЛО(10, 0))
	|		КОНЕЦ) КАК Резерв
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	ВТ_Сопоставление КАК ВТ_Сопоставление
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиОбъединение КАК ВТ_ОстаткиОбъединение
	|		ПО ВТ_Сопоставление.Номенклатура = ВТ_ОстаткиОбъединение.Номенклатура
	|			И ВТ_Сопоставление.Характеристика = ВТ_ОстаткиОбъединение.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Сопоставление.ПолеСопоставления,
	|	ВТ_Сопоставление.Номенклатура,
	|	ВТ_Сопоставление.Характеристика";
		
	Текст = Текст + ";";
	
	Возврат Текст;

КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 01.03.24 УА #67173

//+ ИнфоСофт Ивонин К.А. 14.03.24 УА #71892
Функция ПолучитьСкладПоУмолчанию(Маркетплейс, Профиль) Экспорт

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда
		Возврат ИС_WB_Сервер.ПолучитьСкладПоУмолчанию(Профиль);
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		Возврат ИС_Ozon_Сервер.ПолучитьСкладПоУмолчанию(Профиль);
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		Возврат ИС_ЯМ_Сервер.ПолучитьСкладПоУмолчанию(Профиль);
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		Возврат ИС_Сбер_Сервер.ПолучитьСкладПоУмолчанию(Профиль);
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		Возврат ИС_АЛИ_Сервер.ПолучитьСкладПоУмолчанию(Профиль);
	КонецЕсли;
	
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода Тогда
		Возврат ИС_Ламода_Сервер.ПолучитьСкладПоУмолчанию(Профиль);
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	
	Возврат Справочники.Склады.ПустаяСсылка();

КонецФункции //- ИнфоСофт Ивонин К.А. 14.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 20.03.24 УА #71892
Функция ПолучитьОстаткиFBS(Маркетплейс, Профиль, Склад) Экспорт

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда
		Возврат ИС_WB_Сервер.ПолучитьОстаткиFBS(Профиль, Склад);
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		Возврат ИС_Ozon_Сервер.ПолучитьОстаткиFBS(Профиль, Склад);
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		Возврат ИС_ЯМ_Сервер.ПолучитьОстаткиFBS(Профиль, Склад);
	КонецЕсли;
    
    // У МегаМаркета нет метода API для получения остатков
	//Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
	//	Возврат ИС_Сбер_Сервер.ПолучитьОстаткиFBS(Профиль, Склад);
	//КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		Возврат ИС_АЛИ_Сервер.ПолучитьОстаткиFBS(Профиль, Склад);
	КонецЕсли;
	
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Ламода Тогда
		Возврат ИС_Ламода_Сервер.ПолучитьОстатки(Профиль);
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120
	
	Возврат Новый ТаблицаЗначений;

КонецФункции //- ИнфоСофт Ивонин К.А. 20.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 20.03.24 УА #71892
Функция ПолучитьПолеСопоставленияОстатков(Маркетплейс) Экспорт

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда
		Возврат "РазмерWB";
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		Возврат "НоменклатураOzon";
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		Возврат "НоменклатураЯМ";
	КонецЕсли;
    
    Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		Возврат "НоменклатураСбер";
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		Возврат "ВариацияAli";
	КонецЕсли;
	
	ОбщийМодуль = ИС_МП_Сервер.ОбщийМодульМаркетплейса(Маркетплейс);
	Возврат ОбщийМодуль.ПолеСопоставленияОстатков();

КонецФункции //- ИнфоСофт Ивонин К.А. 20.03.24 УА #71892

//+ ИнфоСофт Стояк Ю.К. 25.12.2023 УА #66947
Процедура ЗаписатьСкрываемыйОстаток(Профиль, Маркетплейс, Склад, КарточкаМП, Остаток) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ИС_MP_ОграничениеОстатков.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.Маркетплейс = Маркетплейс;
	МенеджерЗаписи.Склад = Склад;
	МенеджерЗаписи.КарточкаМП = КарточкаМП;
	МенеджерЗаписи.Прочитать();
			
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.Маркетплейс = Маркетплейс;
	МенеджерЗаписи.Склад = Склад;
	МенеджерЗаписи.КарточкаМП = КарточкаМП;
	МенеджерЗаписи.Остаток = Остаток;

	МенеджерЗаписи.Записать(Истина);		
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.12.2023 УА #66947

//+ ИнфоСофт Ивонин К.А. 28.03.24 УА #71892
Процедура ЗаписатьРучнойОстаток(Профиль, Маркетплейс, Склад, КарточкаМП, Остаток) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ИС_MP_РучныеОстатки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.Маркетплейс = Маркетплейс;
	МенеджерЗаписи.Склад = Склад;
	МенеджерЗаписи.КарточкаМП = КарточкаМП;
	МенеджерЗаписи.Прочитать();
			
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.Маркетплейс = Маркетплейс;
	МенеджерЗаписи.Склад = Склад;
	МенеджерЗаписи.КарточкаМП = КарточкаМП;
	МенеджерЗаписи.Остаток = Остаток;

	МенеджерЗаписи.Записать(Истина);		
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 28.03.24 УА #71892
Процедура ЗаписатьПоследнийВыгруженныйОстаток(Профиль, Маркетплейс, Склад, КарточкаМП, Остаток) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ИС_MP_ПоследниеВыгруженныеОстатки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.Маркетплейс = Маркетплейс;
	МенеджерЗаписи.Склад = Склад;
	МенеджерЗаписи.КарточкаМП = КарточкаМП;
	МенеджерЗаписи.Прочитать();
			
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.Маркетплейс = Маркетплейс;
	МенеджерЗаписи.Склад = Склад;
	МенеджерЗаписи.КарточкаМП = КарточкаМП;
	МенеджерЗаписи.Остаток = Остаток;

	МенеджерЗаписи.Записать(Истина);		
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.03.24 УА #71892

//+ ИнфоСофт Стояк Ю.К. 25.12.2023 УА #66947
Процедура УдалитьСкрываемыйОстаток(Профиль, Маркетплейс, Склад, КарточкаМП) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ИС_MP_ОграничениеОстатков.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.Маркетплейс = Маркетплейс;
	МенеджерЗаписи.Склад = Склад;
	МенеджерЗаписи.КарточкаМП = КарточкаМП;
	МенеджерЗаписи.Удалить();		
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.12.2023 УА #66947

//+ ИнфоСофт Ивонин К.А. 28.03.24 УА #71892
Процедура УдалитьРучнойОстаток(Профиль, Маркетплейс, Склад, КарточкаМП) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ИС_MP_РучныеОстатки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Профиль = Профиль;
	МенеджерЗаписи.Маркетплейс = Маркетплейс;
	МенеджерЗаписи.Склад = Склад;
	МенеджерЗаписи.КарточкаМП = КарточкаМП;
	МенеджерЗаписи.Удалить();		
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 01.04.24 УА #71892
Функция ПолучитьИнформациюОСкладе(Маркетплейс, Склад) Экспорт

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ Тогда
		Возврат ИС_WB_Сервер.ПолучитьИнформациюОСкладе(Склад);
	КонецЕсли;
	
	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Озон Тогда
		Возврат ИС_Ozon_Сервер.ПолучитьИнформациюОСкладе(Склад);
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ЯМ Тогда
		Возврат ИС_ЯМ_Сервер.ПолучитьИнформациюОСкладе(Склад);
	КонецЕсли;
    
    Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Сбер Тогда
		Возврат ИС_Сбер_Сервер.ПолучитьИнформациюОСкладе(Склад);
	КонецЕсли;

	Если Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.Али Тогда
		Возврат ИС_АЛИ_Сервер.ПолучитьИнформациюОСкладе(Склад);
	КонецЕсли;
	
	ОбщийМодуль = ИС_МП_Сервер.ОбщийМодульМаркетплейса(Маркетплейс);
	Возврат ОбщийМодуль.ИнформацияОСкладе(Склад);

КонецФункции //- ИнфоСофт Ивонин К.А. 01.04.24 УА #71892

#КонецОбласти

#Область РегламентныеЗадания

//+ ИнфоСофт Ивонин К.А. 03.05.24 УА #75485
Функция СписокРегламентныхЗаданий() Экспорт

	Результат = Новый Структура;
	
	Результат.Вставить("ЗагрузкаДанныхИзВнешнегоИсточника", "Загружать данные автоматически");
	
	Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 03.05.24 УА #75485 

//+ ИнфоСофт Ивонин К.А. 11.11.23 УА #55166
Процедура ВыполнитьКомандуРеглЗадания(Источник, ИдентификаторКомандыОбработки) Экспорт

	Событие = ИмяСобытия("ВыполнитьКомандуРеглЗадания");
	
	Если ИдентификаторКомандыОбработки = "ЗагрузкаДанныхИзВнешнегоИсточника" Тогда
		//ВыгрузитьЦены(Профиль);
		Возврат;				
	КонецЕсли;
			
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 11.11.23 УА #55166

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 11.02.23 УА #53535
Функция ИмяСобытия(Имя)
	Возврат "ИС.МП.ИС_МП_УправлениеОстатками." + Имя;
КонецФункции //- ИнфоСофт Ивонин К.А. 11.02.23 УА #53535

#КонецОбласти
